---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.CurvesOverlap
source: html/b82f576f-163c-d370-bed9-951193acfc07.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.CurvesOverlap Property

Highlighted lines overlap. Lines may not form closed loops.

## Syntax (C#)
```csharp
public static FailureDefinitionId CurvesOverlap { get; }
```